tests/ycsb/results/bw_bench_vanilla_20260418_000043/phase2_hotspot.txt
/usr/bin/java  -classpath /tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-vanilla-bench-11052/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-vanilla-bench-11052/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=16 -p redis.host=127.0.0.1 -p redis.port=6380 -p redis.timeout=30000
Command line: -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-vanilla-bench-11052/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=16 -p redis.host=127.0.0.1 -p redis.port=6380 -p redis.timeout=30000
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-04-18 00:04:50:263 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-18 00:05:00:208 10 sec: 343279 operations; 34317.6 current ops/sec; est completion in 49 seconds [READ: Count=274903, Max=23919, Min=19, Avg=451.48, 90=638, 99=2435, 99.9=6227, 99.99=16207] [UPDATE: Count=68586, Max=22639, Min=26, Avg=476.92, 90=690, 99=2639, 99.9=6703, 99.99=17151] 
2026-04-18 00:05:10:199 20 sec: 673387 operations; 33017.4 current ops/sec; est completion in 40 seconds [READ: Count=264117, Max=47839, Min=25, Avg=476.93, 90=635, 99=2487, 99.9=6347, 99.99=32559] [UPDATE: Count=65911, Max=46879, Min=28, Avg=494.68, 90=656, 99=2521, 99.9=6839, 99.99=34335] 
2026-04-18 00:05:20:200 30 sec: 1009451 operations; 33609.76 current ops/sec; est completion in 30 seconds [READ: Count=268921, Max=76287, Min=24, Avg=469.48, 90=635, 99=2717, 99.9=7955, 99.99=22335] [UPDATE: Count=67174, Max=76351, Min=30, Avg=487.21, 90=669, 99=2815, 99.9=7255, 99.99=18847] 
2026-04-18 00:05:30:200 40 sec: 1315955 operations; 30650.4 current ops/sec; est completion in 21 seconds [READ: Count=245395, Max=44159, Min=23, Avg=514.02, 90=706, 99=3235, 99.9=10903, 99.99=27423] [UPDATE: Count=61086, Max=33535, Min=29, Avg=537, 90=733, 99=3385, 99.9=11335, 99.99=27823] 
2026-04-18 00:05:40:202 50 sec: 1684930 operations; 36897.5 current ops/sec; est completion in 10 seconds [READ: Count=295404, Max=32863, Min=20, Avg=427.41, 90=591, 99=2185, 99.9=4955, 99.99=10743] [UPDATE: Count=73648, Max=33343, Min=23, Avg=443.81, 90=617, 99=2269, 99.9=4699, 99.99=9887] 
2026-04-18 00:05:48:412 58 sec: 2000000 operations; 38362.35 current ops/sec; [READ: Count=252089, Max=17135, Min=20, Avg=406.29, 90=576, 99=1991, 99.9=3881, 99.99=8543] [CLEANUP: Count=16, Max=11599, Min=64, Avg=852.5, 90=289, 99=11599, 99.9=11599, 99.99=11599] [UPDATE: Count=62766, Max=12287, Min=27, Avg=423.06, 90=605, 99=2063, 99.9=3895, 99.99=7867] 
[OVERALL], RunTime(ms), 58213
[OVERALL], Throughput(ops/sec), 34356.58701664577
[TOTAL_GCS_G1_Young_Generation], Count, 98
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 209
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.35902633432394826
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 98
[TOTAL_GC_TIME], Time(ms), 209
[TOTAL_GC_TIME_%], Time(%), 0.35902633432394826
[READ], Operations, 1600829
[READ], AverageLatency(us), 456.7328128113621
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 76287
[READ], 95thPercentileLatency(us), 1168
[READ], 99thPercentileLatency(us), 2473
[READ], Return=OK, 1600829
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 852.5
[CLEANUP], MinLatency(us), 64
[CLEANUP], MaxLatency(us), 11599
[CLEANUP], 95thPercentileLatency(us), 344
[CLEANUP], 99thPercentileLatency(us), 11599
[UPDATE], Operations, 399171
[UPDATE], AverageLatency(us), 476.1997264330325
[UPDATE], MinLatency(us), 23
[UPDATE], MaxLatency(us), 76351
[UPDATE], 95thPercentileLatency(us), 1216
[UPDATE], 99thPercentileLatency(us), 2579
[UPDATE], Return=OK, 399171